{
  "articles": [
    {
    "title": "A limitless tool belt",
    "id": "1",
    "author": "Zish k. Pasha",
    "date": "15-06-2017",
    "quote": "We’re digging to find some type of treasure, we keep digging and if we forgot to look up.. we might have dug ourselves too deep",
    "text1": "‘Ding!’. The doorbell rings. A week ago you called the repairman because the air conditioner broke down in the middle of June. Lately your house has been feeling like a life size walk-in oven. ‘Morning!’ the repair man happily says as you open the door. His confident eyes piercing and his tool belt fastened. Fast forward 40 minutes and your living rooms feels as cool as an autumn morning. ‘Anything else I can do for you while I’m here?’. You think, and suddenly remember that one of your sunscreens has stopped working two days ago. ‘Actually, yeah. The sunscreen doesn’t go down anything. Care to take a look at it?’. After investigating the problem for a few minutes the repair man walks up to you and says ‘No can do, I’m afraid. Haven’t got the right tools. I need a T757 screwdriver for this one, which is back at headquarters’.",
    "text2": "And that’s the power of us as a developer. Our tool belts are limitless. For each problem there’s a potential solutions, usually multiple solutions. In fact, there are so many tools and solutions that we don’t even know about  a lot of them. And that’s the point Peter Paul Koch was making during his talk. Yeah, we’ve got tons of tools to develop with. Our browsers are adding new features by the week. But the question is; is this necessarily a good thing?",
    "text3": "Today web apps are doing their best to keep up with native apps. While there’s always a slight difference in speed and possibility; browsers keep adding new features so we as web developer remain competitive to native developers. This however, creates a situation in which a lot of features are missed by the mainstream development community or just plainly left by the wayside. With so many new tools our development areas get bigger and deeper, which makes debugging harder for yourself and other developers. We’re digging to find some type of treasure, we keep digging and if we forgot to look up.. we might have dug ourselves too deep.",
    "text4": "So.. what is the solution? One of the more extreme solutions could be to just stop adding features for a while. Learn and work with what we have until we perfected it. But that’s a pretty bold idea. Another though is to accept that the web is different on all kinds of devices and context. And instead of viewing this as a bad thing we can view it as a good thing; a strength. Maybe if we stop trying to make web apps look and behave like native apps, we can embrace it’s power of flexibility and work on making smaller, friendlier tools. I’ll get right to that after checking out the sweet new Angular 4 release.",
    "urlToImage": "http://www.floretflowers.com/wp-content/uploads/2015/11/Floret_Farmer-Florist-Toolbelt-179.jpg"
    },
    {
    "title": "Thinking on paper",
    "id": "2",
    "author": "Zish k. Pasha",
    "date": "15-06-2017",
    "quote": "But that’s the beauty of sketch noting; there is no wrong. You are the audience. You are free and with each pen stroke you have the power to do anything",
    "text1": "Sketch noting is the idea that instead of using only words and sentences to takes notes, you use icons, drawings and words. Some people might think ‘That sounds pretentious..’ or ‘Too difficult and not efficient’. These people usually draw these conclusions without actually trying it. Sketch noting is about letting yourself go. It’s about being free. Free to take in information, free to remember information and most importantly; free to express yourself to yourself. Let’s imagine two different scenarios where you’re at a conference in which you’ll be taking notes.",
    "text2": "Scenario one; traditional writing. You’re at a conference. The day is filled with interesting speakers giving talks on a range of subjects. At each talk you furiously write down the important points and do your best to not fall behind. At the end of the day you’re feeling great because you’ve practically written a book that’s filled with great advice, tips and sources. Fast forward a few weeks. You’re facing a UX problem. Suddenly you remember you heard a great talk on UX a few weeks before at the conference. You grab your notebook and start turning pages. Each page looks the same; text. You’re having a hard time finding specific subjects let alone a single piece of advice. It’s not an enjoyable or fun experience to look through the notes you made.",
    "text3": "Scenario two; Sketch noting. You’re at a conference. The day is filled with interesting speakers giving talks on a range of subjects.At each talk you casually write down words, connect them with clouds and sketch down your thoughts. You’re listening and fully focused on the speaker while you let your pen dance on the paper. At the end of the conference you’re feeling happy, you’ve got a nice book full of sketch notes. Fast forward a few weeks. You’re facing a UX problem, suddenly you remember you’ve heard a great talk on UX a few weeks before at the conference. You grab your sketch noting book and start browsing. You smile. A lot of the quick drawings are amusing, and they’re all telling. With a quick glance of the page you know exactly what the talk was about and more importantly; what you took from it. Before you know it you found what you were looking for as well as remember a lot of other stuff.",
    "text4": "This is the essence of what Eva-lotta lamm was saying in her talk. Sketch noting isn’t about doing the thing that’s ‘hip’ at the moment, nor is it a way to try and be more creative. It’s merely about having a deep and profound connection with your own subconscious. You draw what you think, you draw what you feel. And with time, you’ll be able to reflect upon your own sketch notes and your current self will be communicating with your past self through your drawings and words. A lot of people fear the idea of sketching. They’re afraid that they aren’t good enough to draw. But that’s the beauty of sketch noting; there is no wrong. You are the audience. You are free and with each pen stroke you have the power to do anything. So the next time you’re thinking about taking written notes at a conference; let yourself go and try sketching. Who knows, maybe your future self will thank you.",
    "urlToImage": "https://c1.staticflickr.com/3/2919/14267084208_a97c7c4e67_b.jpg"
    },
    {
    "title": "The web is for everyone",
    "id": "3",
    "author": "Zish k. Pasha",
    "date": "15-06-2017",
    "quote": "While I was excited and ready for the talk; nothing could prepare me for it. That day fundamentally changed the way I look at the web, my career and the world",
    "text1": "When I heard one of our speakers for the Weekly nerd would be a ‘blind developer’ I wasn’t sure what to expect. I was certainly intrigued and curious as to how Bram worked and what he’d have to tell us. But I didn’t have a clear picture on what it means to browse and work with the internet without being able to see. Sure, I’ve tabbed through pages and used screen readers before while testing. But for a limited time and in a controlled environment. While I was excited and ready for the talk; nothing could prepare me for it. That day fundamentally changed the way I look at the web, my career and the world.",
    "text2": "It was around 4pm and we we’re waiting for the talk to begin. A guy walked in with his black dog. As the dog took to resting under the desk, Bram started setting up his equipment. He has a windows laptop and a special kind of keyboard. One which allowed him to feel text on the screen with a number of pins that pop in and out. A braille keyboard. It was the first time I saw anything like it, and before the talk even started I was already impressed by the way Bram set up his work station.",
    "text3": "When the presentation started Bram took us through the HvA website and showed us what it was like to browse the web without seeing, and what kind of problems he encountered on a daily basis. Headings are a crucial part of good usability. The right headings can tell a user exactly what the page is about and where to find important and relevant information. Using heading levels is also extremely important as it tells the screen reader which headings to focus on first. Using the correct element in HTML is a must. If something is a link, us a <a> tag. If something is clickable, use a button. When you use a div as a button it doesn’t actually tell the screen reader anything. It’s just a div without context. Don’t force users into your own preferences. Using absolute sizes like pixels is asking for trouble. Use Em’s and percentages so the user can scale the font size if they have a hard time seeing.",
    "text4": "After the talk was over I just sat there for a bit. Lost in thought, inspired. Here was a blind developer that not only had more knowledge about the web and it’s inner workings than I did, he browsed and read a website faster and more accurate than I ever could. This truly made me realize what Vasilis has always been telling us; the web is for everyone. And not only can everyone use the web, they can all use it equally efficiently and in their own way. As a web developer it is my responsibility to make sure it stays this way. I can create website and apps that are open and accessible to everyone. And I can inspire others to do so too.",
    "urlToImage": "https://c1.staticflickr.com/9/8030/8071126660_66f800bc6a_b.jpg"
    },
    {
    "title": "The house of the future",
    "id": "4",
    "author": "Zish k. Pasha",
    "date": "15-06-2017",
    "quote": "Using these simple boards you can prototype and create interactive, exciting experiences which truly have the potential to change the way we live and interact with the world around us",
    "text1": "Soft and relaxing guitar music starts playing in the background. The ambient lights in your living room slowly come alive as the sun does in the early morning. The oven starts preheating. You hang your coat, it was a long day and you’re tired. As you walk into the kitchen the refrigerator door opens, you get out food and put it in the oven. You walk to the living room, the tv starts and the guitar music fades out. You sit down on the couch and a bottle of ice cooled beer slides down from a tube in the wall right into your hand. Your feet land on the table and you take a sip. Time to lay back and relax.",
    "text2": "This is what Internet of things can bring us. A world that’s connected to you and the internet. Small things that are usually a drag can be automated, or made fun again. Niels showed us the steps he’s been taking to automate his house. His chicken water heats up automatically based on the weather. He gets a signal whenever there’s mail and he knows the status of his washing machine. Are these things a must? No. But they can make life easier and inspire you to let go and be creative. All those things that were once sci-fi can become a reality with a few simple tools and skillsets.",
    "text3": "Arduino and NodeMCU changed a lot for Internet of things. Using these simple boards you can prototype and create interactive, exciting experiences which truly have the potential to change the way we live and interact with the world around us. Safety can be an issues; A lot of cheaper IoT devices don’t have a secured connection and the last thing you want is someone being able to open the door to your house. But this shouldn’t scare you off from experimenting with IoT. So what if someone takes the effort to hack your desk lamp and change the color to purple? That’s not the worse that can happen. Just be aware of what you use IoT for.",
    "text4": "‘The house of the future’ really isn’t an impossible of unrealistic idea anymore. We can dream up concepts and ideas for our automated house and then build prototypes of these ideas using tools like Arduino and NodeMCU. As cliché as it may sound, your imagination truly is the limit. So the next time you come up with a coffee machine that starts brewing as soon as you get out of bed; write it down, order a NodeMCU and a pressure sensor.. and start building!",
    "urlToImage": "http://i.vimeocdn.com/video/583689455_1280x720.jpg"
    }
    ]
}
